#+TITLE: Doom emacs config

I use [[https://github.com/hlissner/doom-emacs][doom emacs]] to write notes, articles, and code, as an email client, and to
keep track of projects and appointments. Most of this happens in org-mode.

** Citations

Citation management used to be a mess. Now it's fairly easy with the new
org-internal citation format and the citar package.

#+begin_src emacs-lisp :tangle yes
(use-package! citar
  :hook
  (LaTeX-mode . citar-capf-setup)
  (org-mode . citar-capf-setup)) ; doesn't work :(
  :config
  (setq! citar-bibliography '("~/notes/literature.bib")
         citar-library-paths '("~/papers/[A-Z]/")
         citar-notes-paths '("~/notes/literature/")
         org-cite-global-bibliography '("~/notes/literature.bib")
         citar-org-roam-note-title-template "${author editor:*%sn} ${date year issued:4} ${title}"
         citar-org-roam-cpature-template-key "l"
         citar-org-roam-subdir "literature"
  )
;; (use-package citar-org-roam
;;   :after (citar org-roam)
;;   :config (citar-org-roam-mode))
(after! oc-csl
  (setq org-cite-csl-styles-dir "~/Zotero/styles"))
#+end_src

#+RESULTS:
: ~/Zotero/styles

